           COPY "Identification.cpy".
           02 BANK-NAME PIC X(30).       
           02 BANK-ADDRESS PIC X(50).       
           02 TELEFON PIC X(15).
           02 EMAIL PIC X(40).
