       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL. 
           SELECT IN-TRANSACTIONS-FILE
               ASSIGN TO "Transactions.txt"
               ORGANIZATION IS LINE SEQUENTIAL.

           SELECT IN-BANKS-FILE
               ASSIGN TO "Banks.txt"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD IN-BANKS-FILE.
       01 IN-BANK-RECORD.
           COPY "BankRecord.cpy".

       FD IN-TRANSACTIONS-FILE.
       01 IN-TRANSACTION-RECORD.
           COPY "TransactionRecord.cpy". 

       WORKING-STORAGE SECTION.
       
       01 BANKS OCCURS 25 TIMES.
           COPY "BankRecord.cpy".

       01 TRANSACTIONS OCCURS 100 TIMES.
           COPY "TransactionRecord.cpy". 
           02 AMOUNT PIC S9(11)V99.
           02 AMOUNT-DISPLAY PIC -ZZZ,ZZZ,ZZZ,ZZZ9.99.
           02 DKK-AMOUNT PIC S9(11)V99.
           02 DKK-AMOUNT-DISPLAY PIC -ZZZ,ZZZ,ZZZ,ZZZ9.99.

       01 CUSTOMERS OCCURS 25 TIMES.
           COPY "CustomerInfo.cpy".
           02 DKK-TOTAL-INCOME PIC S9(11)V99.
           02 DKK-TOTAL-INCOME-DISPLAY PIC -ZZZ,ZZZ,ZZZ,ZZZ9.99.
           02 DKK-TOTAL-PAYMENTS PIC S9(11)V99.
           02 DKK-TOTAL-PAYMENTS-DISPLAY PIC -ZZZ,ZZZ,ZZZ,ZZZ9.99.
           02 DKK-SALDO PIC S9(11)V99.
           02 DKK-SALDO-DISPLAY PIC -ZZZ,ZZZ,ZZZ,ZZZ9.99.
           02 TRANSACTION-INDICES PIC 99 OCCURS 8 TIMES.
           02 CUSTOMER-TRANSACTIONS-COUNT PIC 9 VALUE 0.
           02 CUSTOMER-BANK-INDEX PIC 99.
           02 OUTPUT-LINES PIC X(100) OCCURS 25 TIMES.

       01 END-OF-FILE PIC X VALUE "N".
       01 LINE-INDEX PIC 99 VALUE 1.
       01 TRANSACTIONS-COUNT PIC 99 VALUE 0.
       01 BANKS-COUNT PIC 99 VALUE 0.
       01 CUSTOMER-COUNT PIC 99 VALUE 0.

       01 BANK-INDEX PIC 99 VALUE 1.
       01 CUSTOMER-INDEX PIC 99 VALUE 1. 
       01 CUSTOMER-TRANSACTION-INDEX PIC 9 VALUE 1.
       01 CURRENT-TRANSACTION-INDEX PIC 99 VALUE 0.

       01 TRANSACTION-INDEX PIC 99 VALUE 1.

       01 BANK-MATCH-FOUND PIC X VALUE "N".
       01 MATCHED-BANK-INDEX PIC 9 VALUE 0.

       01 CUSTOMER-FOUND     PIC X VALUE "N".
       01 MATCHED-CUSTOMER-INDEX PIC 9 VALUE 0.
       01 SEARCH-CPR PIC X(15).

       01 NEXT-TRANSACTION-SLOT PIC 99 VALUE 0.


       PROCEDURE DIVISION.          
           PERFORM LOAD-BANKS-DATA-TO-ARRAY
           PERFORM RESET-LOOP-VARIABLES
           PERFORM LOAD-TRANSACTIONS-DATA-TO-ARRAY
           PERFORM FILL-CUSTOMER-ARRAY

           PERFORM PRINT-CUSTOMERS
       STOP RUN.

       FILL-CUSTOMER-ARRAY.
           PERFORM VARYING TRANSACTION-INDEX FROM 1 BY 1
               UNTIL TRANSACTION-INDEX > TRANSACTIONS-COUNT
           
      *    DISPLAY TRANSACTIONS(TRANSACTION-INDEX)
           MOVE CPR OF TRANSACTIONS(TRANSACTION-INDEX)
               TO SEARCH-CPR
           PERFORM CHECK-CUSTOMER-EXISTS

           IF CUSTOMER-FOUND = "Y"
               PERFORM ADD-INDEX-TO-EXISTING-CUSTOMER
           ELSE
               PERFORM ADD-NEW-CUSTOMER-TO-ARRAY
           END-IF

           END-PERFORM
           EXIT.
       
       ADD-INDEX-TO-EXISTING-CUSTOMER.
           DISPLAY "Adding Transaction Index '" TRANSACTION-INDEX 
               "' to existing Customer with CPR '" 
               FUNCTION TRIM(CPR 
                   OF TRANSACTIONS(TRANSACTION-INDEX) TRAILING)
               "'."

           ADD 1 TO CUSTOMER-TRANSACTIONS-COUNT
               OF CUSTOMERS(MATCHED-CUSTOMER-INDEX)

           MOVE CUSTOMER-TRANSACTIONS-COUNT
               OF CUSTOMERS(MATCHED-CUSTOMER-INDEX)
               TO NEXT-TRANSACTION-SLOT

           MOVE TRANSACTION-INDEX
               TO TRANSACTION-INDICES(MATCHED-CUSTOMER-INDEX, 
                   NEXT-TRANSACTION-SLOT)

           EXIT.

       ADD-NEW-CUSTOMER-TO-ARRAY.
           DISPLAY "Creating new Customer with CPR '"
               FUNCTION TRIM(CPR 
                   OF TRANSACTIONS(TRANSACTION-INDEX) TRAILING) "'."
           DISPLAY "Adding '" TRANSACTION-INDEX "' to new Customer."
           ADD 1 TO CUSTOMER-COUNT

           MOVE CPR OF TRANSACTIONS(TRANSACTION-INDEX)
               TO CPR OF CUSTOMERS(CUSTOMER-COUNT)
           MOVE CUSTOMER-NAME OF TRANSACTIONS(TRANSACTION-INDEX)
               TO CUSTOMER-NAME OF CUSTOMERS(CUSTOMER-COUNT)
           MOVE CUSTOMER-ADDRESS OF TRANSACTIONS(TRANSACTION-INDEX)
               TO CUSTOMER-ADDRESS OF CUSTOMERS(CUSTOMER-COUNT)

           PERFORM FIND-MATCHING-BANK
           MOVE MATCHED-BANK-INDEX
               TO CUSTOMER-BANK-INDEX OF CUSTOMERS(CUSTOMER-COUNT)

           ADD 1 TO CUSTOMER-TRANSACTIONS-COUNT
               OF CUSTOMERS(CUSTOMER-COUNT)

           MOVE CUSTOMER-TRANSACTIONS-COUNT
               OF CUSTOMERS(CUSTOMER-COUNT)
               TO NEXT-TRANSACTION-SLOT

           MOVE TRANSACTION-INDEX
               TO TRANSACTION-INDICES(CUSTOMER-COUNT, 
                   NEXT-TRANSACTION-SLOT)

           EXIT.

       CHECK-CUSTOMER-EXISTS.
           MOVE "N" TO CUSTOMER-FOUND

           PERFORM VARYING CUSTOMER-INDEX FROM 1 BY 1
               UNTIL CUSTOMER-INDEX > CUSTOMER-COUNT
                  OR CUSTOMER-FOUND = "Y"

               IF CPR OF CUSTOMERS(CUSTOMER-INDEX)
                  = SEARCH-CPR
                   MOVE "Y" TO CUSTOMER-FOUND
                   MOVE CUSTOMER-INDEX TO MATCHED-CUSTOMER-INDEX
               END-IF
           END-PERFORM

           MOVE SPACES TO SEARCH-CPR

           EXIT.
       
       PRINT-CUSTOMERS.
           PERFORM VARYING CUSTOMER-INDEX FROM 1 BY 1
               UNTIL CUSTOMER-INDEX > CUSTOMER-COUNT
           
           PERFORM COMPUTE-TOTALS

           END-PERFORM
           EXIT.

       COMPUTE-TOTALS.
           MOVE 0 TO DKK-TOTAL-INCOME OF CUSTOMERS(CUSTOMER-INDEX)
           MOVE 0 TO DKK-TOTAL-PAYMENTS OF CUSTOMERS(CUSTOMER-INDEX)
       
           PERFORM VARYING CUSTOMER-TRANSACTION-INDEX FROM 1 BY 1
               UNTIL CUSTOMER-TRANSACTION-INDEX >
                   CUSTOMER-TRANSACTIONS-COUNT 
                       OF CUSTOMERS(CUSTOMER-INDEX)
       
               MOVE TRANSACTION-INDICES(CUSTOMER-INDEX, 
                   CUSTOMER-TRANSACTION-INDEX)
                   TO CURRENT-TRANSACTION-INDEX
       
               IF TRANSACTION-TYPE 
                   OF TRANSACTIONS(CURRENT-TRANSACTION-INDEX)
                       = "Indbetaling"
                   OR
                  (TRANSACTION-TYPE 
                   OF TRANSACTIONS(CURRENT-TRANSACTION-INDEX)
                       = "Overfoersel"
                   AND DKK-AMOUNT 
                       OF TRANSACTIONS(CURRENT-TRANSACTION-INDEX)
                       >= 0)
       
                   ADD DKK-AMOUNT 
                       OF TRANSACTIONS(CURRENT-TRANSACTION-INDEX)
                       TO DKK-TOTAL-INCOME OF CUSTOMERS(CUSTOMER-INDEX)
               END-IF
       
               IF TRANSACTION-TYPE 
                      OF TRANSACTIONS(CURRENT-TRANSACTION-INDEX)
                      = "Udbetaling"
               
                   SUBTRACT DKK-AMOUNT 
                       OF TRANSACTIONS(CURRENT-TRANSACTION-INDEX)
                   FROM DKK-TOTAL-PAYMENTS 
                       OF CUSTOMERS(CUSTOMER-INDEX)
               
               ELSE IF TRANSACTION-TYPE 
                           OF TRANSACTIONS(CURRENT-TRANSACTION-INDEX)
                           = "Overfoersel"
                       AND DKK-AMOUNT 
                           OF TRANSACTIONS(CURRENT-TRANSACTION-INDEX)
                           < 0
               
                   ADD DKK-AMOUNT 
                       OF TRANSACTIONS(CURRENT-TRANSACTION-INDEX)
                       TO DKK-TOTAL-PAYMENTS 
                           OF CUSTOMERS(CUSTOMER-INDEX)
               
               END-IF
           END-PERFORM
    
           COMPUTE DKK-SALDO OF CUSTOMERS(CUSTOMER-INDEX) =
               50000.00
               + DKK-TOTAL-INCOME OF CUSTOMERS(CUSTOMER-INDEX)
               + DKK-TOTAL-PAYMENTS OF CUSTOMERS(CUSTOMER-INDEX)
           
           MOVE DKK-TOTAL-INCOME OF CUSTOMERS(CUSTOMER-INDEX)
               TO DKK-TOTAL-INCOME-DISPLAY OF CUSTOMERS(CUSTOMER-INDEX)

           MOVE DKK-TOTAL-PAYMENTS OF CUSTOMERS(CUSTOMER-INDEX)
               TO DKK-TOTAL-PAYMENTS-DISPLAY 
                   OF CUSTOMERS(CUSTOMER-INDEX)

           MOVE DKK-SALDO OF CUSTOMERS(CUSTOMER-INDEX)
               TO DKK-SALDO-DISPLAY OF CUSTOMERS(CUSTOMER-INDEX)

           EXIT.
           

       FIND-MATCHING-BANK.
           MOVE "N" TO BANK-MATCH-FOUND
           MOVE 0 TO MATCHED-BANK-INDEX

           PERFORM VARYING BANK-INDEX FROM 1 BY 1
               UNTIL BANK-INDEX > BANKS-COUNT
                  OR BANK-MATCH-FOUND = "Y"

               IF REGISTRATION-NUMBER OF TRANSACTIONS(TRANSACTION-INDEX)
                  = REGISTRATION-NUMBER OF BANKS(BANK-INDEX)
                   MOVE "Y" TO BANK-MATCH-FOUND
                   MOVE BANK-INDEX TO MATCHED-BANK-INDEX
                   DISPLAY "Found Bank information for '" 
                       REGISTRATION-NUMBER 
                           OF TRANSACTIONS(TRANSACTION-INDEX)
                       "' on Index: " BANK-INDEX
               END-IF
           END-PERFORM
           EXIT.

       LOAD-TRANSACTIONS-DATA-TO-ARRAY.
           DISPLAY "START LOAD-TRANSACTIONS, LINE-INDEX = " LINE-INDEX
           OPEN INPUT IN-TRANSACTIONS-FILE
           PERFORM UNTIL END-OF-FILE = "Y"
               READ IN-TRANSACTIONS-FILE INTO IN-TRANSACTION-RECORD
                   AT END
                       DISPLAY "Found End of Transactions "
                       "Information file on line: " LINE-INDEX
                       MOVE "Y" TO END-OF-FILE
                   NOT AT END                       
                       PERFORM MOVE-TRANSACTION-RECORD-TO-ARRAY
      *                DISPLAY IN-TRANSACTION-RECORD
                       DISPLAY "Not At End Index: " LINE-INDEX
                       ADD 1 TO LINE-INDEX
                       ADD 1 TO TRANSACTIONS-COUNT
               END-READ
           END-PERFORM
           DISPLAY "END LOAD-TRANSACTIONS, LINE-INDEX = " LINE-INDEX
           CLOSE IN-TRANSACTIONS-FILE
           EXIT.
       
       MOVE-TRANSACTION-RECORD-TO-ARRAY.
           MOVE CPR OF IN-TRANSACTION-RECORD
               TO CPR OF TRANSACTIONS(LINE-INDEX)

           MOVE CUSTOMER-NAME OF IN-TRANSACTION-RECORD
               TO CUSTOMER-NAME OF TRANSACTIONS(LINE-INDEX)

           MOVE CUSTOMER-ADDRESS OF IN-TRANSACTION-RECORD
               TO CUSTOMER-ADDRESS OF TRANSACTIONS(LINE-INDEX)

           MOVE BIRTHDAY OF IN-TRANSACTION-RECORD
               TO BIRTHDAY OF TRANSACTIONS(LINE-INDEX)

           MOVE ACCOUNT-IDENTIFICATION OF IN-TRANSACTION-RECORD
               TO ACCOUNT-IDENTIFICATION OF TRANSACTIONS(LINE-INDEX)

           MOVE REGISTRATION-NUMBER OF IN-TRANSACTION-RECORD
               TO REGISTRATION-NUMBER OF TRANSACTIONS(LINE-INDEX)

           MOVE RAW-AMOUNT OF IN-TRANSACTION-RECORD
               TO RAW-AMOUNT OF TRANSACTIONS(LINE-INDEX)

           MOVE CURRENCY-CODE OF IN-TRANSACTION-RECORD
               TO CURRENCY-CODE OF TRANSACTIONS(LINE-INDEX)

           MOVE TRANSACTION-TYPE OF IN-TRANSACTION-RECORD
               TO TRANSACTION-TYPE OF TRANSACTIONS(LINE-INDEX)

           MOVE SHOP OF IN-TRANSACTION-RECORD
               TO SHOP OF TRANSACTIONS(LINE-INDEX)

           MOVE TIME-OF-TRANSACTION OF IN-TRANSACTION-RECORD
               TO TIME-OF-TRANSACTION OF TRANSACTIONS(LINE-INDEX)
           
           PERFORM COMPUTE-AMOUNT

           EXIT.

       COMPUTE-AMOUNT.
           COMPUTE AMOUNT OF TRANSACTIONS(LINE-INDEX) = 
               FUNCTION NUMVAL(RAW-AMOUNT OF IN-TRANSACTION-RECORD)
           
           IF TRANSACTION-TYPE OF IN-TRANSACTION-RECORD = "Indbetaling"
              OR TRANSACTION-TYPE 
               OF IN-TRANSACTION-RECORD = "Udbetaling"
              
              COMPUTE AMOUNT OF TRANSACTIONS(LINE-INDEX) =
                      FUNCTION ABS(AMOUNT OF TRANSACTIONS(LINE-INDEX))
           END-IF           
           
           MOVE AMOUNT OF TRANSACTIONS(LINE-INDEX)
               TO AMOUNT-DISPLAY OF TRANSACTIONS(LINE-INDEX)           

           IF CURRENCY-CODE OF IN-TRANSACTION-RECORD = "USD"
               COMPUTE DKK-AMOUNT OF TRANSACTIONS(LINE-INDEX) = 
                   AMOUNT OF TRANSACTIONS(LINE-INDEX) * 6.8
               MOVE DKK-AMOUNT OF TRANSACTIONS(LINE-INDEX)
                   TO DKK-AMOUNT-DISPLAY OF TRANSACTIONS(LINE-INDEX)
           ELSE IF CURRENCY-CODE OF IN-TRANSACTION-RECORD = "EUR"
               COMPUTE DKK-AMOUNT OF TRANSACTIONS(LINE-INDEX) = 
                   AMOUNT OF TRANSACTIONS(LINE-INDEX) * 7.5
               MOVE DKK-AMOUNT OF TRANSACTIONS(LINE-INDEX)
                   TO DKK-AMOUNT-DISPLAY OF TRANSACTIONS(LINE-INDEX)
           ELSE IF CURRENCY-CODE OF IN-TRANSACTION-RECORD = "DKK"
               MOVE AMOUNT OF TRANSACTIONS(LINE-INDEX)
                   TO DKK-AMOUNT OF TRANSACTIONS(LINE-INDEX)
               MOVE DKK-AMOUNT OF TRANSACTIONS(LINE-INDEX)
                   TO DKK-AMOUNT-DISPLAY OF TRANSACTIONS(LINE-INDEX)
           END-IF

           EXIT.


       LOAD-BANKS-DATA-TO-ARRAY.
           DISPLAY "START LOAD-BANKS, LINE-INDEX = " LINE-INDEX
           OPEN INPUT IN-BANKS-FILE
           PERFORM UNTIL END-OF-FILE = "Y"
               READ IN-BANKS-FILE INTO IN-BANK-RECORD
                   AT END
                       DISPLAY "Found End of Banks "
                       "Information file on line: " LINE-INDEX
                       MOVE "Y" TO END-OF-FILE
                   NOT AT END                       
                       PERFORM MOVE-BANK-RECORD-TO-ARRAY
      *                DISPLAY IN-BANK-RECORD
                       DISPLAY "Not At End Index: " LINE-INDEX
                       ADD 1 TO LINE-INDEX
                       ADD 1 TO BANKS-COUNT
               END-READ
           END-PERFORM
           DISPLAY "END LOAD-BANKS, LINE-INDEX = " LINE-INDEX
           CLOSE IN-BANKS-FILE

           EXIT.

       MOVE-BANK-RECORD-TO-ARRAY.
           MOVE REGISTRATION-NUMBER OF IN-BANK-RECORD
               TO REGISTRATION-NUMBER OF BANKS(LINE-INDEX)

           MOVE BANK-NAME OF IN-BANK-RECORD
               TO BANK-NAME OF BANKS(LINE-INDEX)

           MOVE BANK-ADDRESS OF IN-BANK-RECORD
               TO BANK-ADDRESS OF BANKS(LINE-INDEX)

           MOVE TELEFON OF IN-BANK-RECORD
               TO TELEFON OF BANKS(LINE-INDEX)

           MOVE EMAIL OF IN-BANK-RECORD
               TO EMAIL OF BANKS(LINE-INDEX)

           EXIT.


       RESET-LOOP-VARIABLES.
           DISPLAY "RESETTING LOOP VARIABLES. LINE-INDEX BEFORE = "
               LINE-INDEX
           MOVE 1 TO LINE-INDEX
           MOVE "N" TO END-OF-FILE
           DISPLAY "RESET DONE. LINE-INDEX AFTER = " LINE-INDEX
           EXIT.
       