           02 CPR PIC X(15).
           02 CUSTOMER-NAME PIC X(30).       
           02 CUSTOMER-ADDRESS PIC X(50).       
           02 BIRTHDAY PIC X(10).
           02 ACCOUNT-IDENTIFICATION PIC X(15).           
           COPY "Identification.cpy".
           02 AMOUNT PIC S9(11)V99.
           02 CURRENCY-CODE PIC X(3).
           02 TRANSACTION-TYPE PIC X(15).
           02 SHOP PIC X(20).
           02 TIME-OF-TRANSACTION PIC X(40).
