           03 CUSTOMER-ID           PIC X(11).
           03 CUSTOMER-NAME         PIC X(20).
           03 CUSTOMER-BIRTHDATE    PIC X(10).
           03 CUSTOMER-ADDRESS      PIC X(30).
           03 CUSTOMER-COUNTRY      PIC X(2).