       02 CUSTOMERS OCCURS 525 TIMES.
           COPY "CustomerRecord.cpy".
           03 SANCTION-FORMATTED-BIRTHDAY PIC X(10).
       02 CUSTOMERS-COUNT PIC 999 VALUE 0.
       02 CUSTOMERS-MAX-COUNT PIC 999 VALUE 525.