       IDENTIFICATION DIVISION.
       PROGRAM-ID. MATCHER.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

       01 MATCH-WORK.
           02 WORK-NAME-MATCH-PERCENT PIC 9(3)V99 VALUE 0.
           02 WORK-NAME-SCORE PIC 9(3)V99 VALUE 0.
           02 WORK-ALIAS-SCORE PIC 9(3)V99 VALUE 0.
           02 WORK-BIRTHDAY-SCORE PIC 9(3)V99 VALUE 0.
           02 WORK-COUNTRY-SCORE PIC 9(3)V99 VALUE 0.
           02 WORK-TOTAL-MATCH-SCORE PIC 9(3)V99 VALUE 0.

       
       01 CUSTOMER-INDEX PIC 999 VALUE 1.
       01 SANCTION-INDEX PIC 999 VALUE 1.
       
       LINKAGE SECTION.
       01 LINK-CUSTOMERS-WRAPPER.
           COPY "CustomersWrapper.cpy".

       01 LINK-SANCTIONS-WRAPPER.
           COPY "SanctionsWrapper.cpy".

       PROCEDURE DIVISION USING
           LINK-CUSTOMERS-WRAPPER
           LINK-SANCTIONS-WRAPPER.

           PERFORM MATCH-CUSTOMERS-TO-SANCTIONS

       GOBACK.

       MATCH-CUSTOMERS-TO-SANCTIONS.
           PERFORM VARYING CUSTOMER-INDEX FROM 1 BY 1
               UNTIL CUSTOMER-INDEX > CUSTOMERS-COUNT
               PERFORM MATCH-ONE-CUSTOMER-TO-SANCTIONS
           END-PERFORM

       EXIT.

       MATCH-ONE-CUSTOMER-TO-SANCTIONS.
           MOVE 0 TO MATCHED-SANCTIONS-COUNT 
               OF CUSTOMERS(CUSTOMER-INDEX)

           PERFORM VARYING SANCTION-INDEX FROM 1 BY 1
               UNTIL SANCTION-INDEX > SANCTIONS-COUNT
               PERFORM EVALUATE-CUSTOMER-AGAINST-SANCTION
           END-PERFORM

           EXIT.

       EVALUATE-CUSTOMER-AGAINST-SANCTION.
           PERFORM RESET-MATCH-WORK
           PERFORM CALCULATE-NAME-AND-ALIAS-SCORE
           PERFORM CALCULATE-BIRTHDAY-SCORE
           PERFORM CALCULATE-COUNTRY-SCORE
           PERFORM CALCULATE-TOTAL-MATCH-SCORE

           IF WORK-TOTAL-MATCH-SCORE > 40
               PERFORM ADD-SANCTION-TO-CUSTOMER
           END-IF

       EXIT.

       RESET-MATCH-WORK.
           MOVE 0 TO WORK-NAME-MATCH-PERCENT
           MOVE 0 TO WORK-NAME-SCORE
           MOVE 0 TO WORK-ALIAS-SCORE
           MOVE 0 TO WORK-BIRTHDAY-SCORE
           MOVE 0 TO WORK-COUNTRY-SCORE
           MOVE 0 TO WORK-TOTAL-MATCH-SCORE

       EXIT.

       CALCULATE-NAME-AND-ALIAS-SCORE.
           PERFORM CALCULATE-NAME-SCORE
           PERFORM CALCULATE-ALIAS-SCORE

           IF WORK-ALIAS-SCORE > WORK-NAME-SCORE
               MOVE WORK-ALIAS-SCORE TO WORK-NAME-SCORE
           END-IF

       EXIT.

       CALCULATE-NAME-SCORE.
           IF CUSTOMER-NAME OF CUSTOMERS(CUSTOMER-INDEX)
               = SANCTION-NAME OF SANCTIONS(SANCTION-INDEX)
               MOVE 50 TO WORK-NAME-SCORE
           END-IF

       EXIT.

       CALCULATE-ALIAS-SCORE.
           IF CUSTOMER-NAME OF CUSTOMERS(CUSTOMER-INDEX)
               = SANCTION-ALIAS-1 OF SANCTIONS(SANCTION-INDEX)
               ADD 10 TO WORK-ALIAS-SCORE
           END-IF

           IF CUSTOMER-NAME OF CUSTOMERS(CUSTOMER-INDEX)
               = SANCTION-ALIAS-2 OF SANCTIONS(SANCTION-INDEX)
               ADD 10 TO WORK-ALIAS-SCORE
           END-IF

           IF CUSTOMER-NAME OF CUSTOMERS(CUSTOMER-INDEX)
               = SANCTION-ALIAS-3 OF SANCTIONS(SANCTION-INDEX)
               ADD 10 TO WORK-ALIAS-SCORE
           END-IF

           IF CUSTOMER-NAME OF CUSTOMERS(CUSTOMER-INDEX)
               = SANCTION-ALIAS-4 OF SANCTIONS(SANCTION-INDEX)
               ADD 10 TO WORK-ALIAS-SCORE
           END-IF

           IF CUSTOMER-NAME OF CUSTOMERS(CUSTOMER-INDEX)
               = SANCTION-ALIAS-5 OF SANCTIONS(SANCTION-INDEX)
               ADD 10 TO WORK-ALIAS-SCORE
           END-IF

       EXIT.

       CALCULATE-BIRTHDAY-SCORE.
           IF SANCTION-FORMATTED-BIRTHDAY OF CUSTOMERS(CUSTOMER-INDEX)
               = SANCTION-BIRTHDATE OF SANCTIONS(SANCTION-INDEX)
               MOVE 30 TO WORK-BIRTHDAY-SCORE
           END-IF

       EXIT.

       CALCULATE-COUNTRY-SCORE.
           IF CUSTOMER-COUNTRY OF CUSTOMERS(CUSTOMER-INDEX)
               = SANCTION-COUNTRY OF SANCTIONS(SANCTION-INDEX)
               MOVE 20 TO WORK-COUNTRY-SCORE
           END-IF

           EXIT.

       CALCULATE-TOTAL-MATCH-SCORE.
           COMPUTE WORK-TOTAL-MATCH-SCORE =
               WORK-NAME-SCORE
               + WORK-BIRTHDAY-SCORE
               + WORK-COUNTRY-SCORE

       EXIT.

       ADD-SANCTION-TO-CUSTOMER.
           IF MATCHED-SANCTIONS-COUNT OF CUSTOMERS(CUSTOMER-INDEX)
               >= MATCHED-SANCTIONS-MAX-COUNT 
                   OF CUSTOMERS(CUSTOMER-INDEX)
               DISPLAY "WARNING: SANCTION ARRAY FULL FOR CUSTOMER "
                   CUSTOMER-ID OF CUSTOMERS(CUSTOMER-INDEX)
               EXIT PARAGRAPH
           END-IF

           ADD 1 TO MATCHED-SANCTIONS-COUNT
               OF CUSTOMERS(CUSTOMER-INDEX)

           MOVE SANCTION-INDEX
               TO MATCHED-SANCTION-INDEX(
                   CUSTOMER-INDEX,
                   MATCHED-SANCTIONS-COUNT OF CUSTOMERS(CUSTOMER-INDEX))

           MOVE WORK-NAME-SCORE
               TO NAME-MATCH-PERCENT(
                   CUSTOMER-INDEX,
                   MATCHED-SANCTIONS-COUNT OF CUSTOMERS(CUSTOMER-INDEX))

           MOVE WORK-ALIAS-SCORE
               TO ALIAS-MATCH-PERCENT(
                   CUSTOMER-INDEX,
                   MATCHED-SANCTIONS-COUNT OF CUSTOMERS(CUSTOMER-INDEX))

           MOVE WORK-BIRTHDAY-SCORE
               TO BIRTHDAY-MATCH-PERCENT(
                   CUSTOMER-INDEX,
                   MATCHED-SANCTIONS-COUNT OF CUSTOMERS(CUSTOMER-INDEX))

           MOVE WORK-COUNTRY-SCORE
               TO COUNTRY-MATCH-PERCENT(
                   CUSTOMER-INDEX,
                   MATCHED-SANCTIONS-COUNT OF CUSTOMERS(CUSTOMER-INDEX))

           MOVE WORK-TOTAL-MATCH-SCORE
               TO TOTAL-MATCH-PERCENT(
                   CUSTOMER-INDEX,
                   MATCHED-SANCTIONS-COUNT OF CUSTOMERS(CUSTOMER-INDEX))

       EXIT.
