           02 OUTPUT-LINE-COUNT PIC 999 VALUE 0.
           02 OUTPUT-TEXT PIC X(120) OCCURS 800 TIMES.
           02 OUTPUT-LINE-MAX-COUNT PIC 999 VALUE 800.