       IDENTIFICATION DIVISION.
       PROGRAM-ID. OUTPUTWRITTER.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUT-REPORT-FILE
               ASSIGN TO "Report.txt"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD OUT-REPORT-FILE.
       01 OUT-REPORT-RECORD PIC X(120).

       WORKING-STORAGE SECTION.
       01 OUTPUT-LINE-INDEX PIC 999 VALUE 0.


       LINKAGE SECTION.
       01 LINK-OUTPUT-WRAPPER.
           COPY "OutputWrapper.cpy".    

       PROCEDURE DIVISION USING
           LINK-OUTPUT-WRAPPER.           

           PERFORM PRINT-REPORT

           GOBACK.

       PRINT-REPORT.
           OPEN OUTPUT OUT-REPORT-FILE
           PERFORM VARYING OUTPUT-LINE-INDEX FROM 1 BY 1
               UNTIL OUTPUT-LINE-INDEX > OUTPUT-LINE-COUNT

               DISPLAY OUTPUT-TEXT(OUTPUT-LINE-INDEX)

               MOVE OUTPUT-TEXT(OUTPUT-LINE-INDEX)
                   TO OUT-REPORT-RECORD

               WRITE OUT-REPORT-RECORD

           END-PERFORM
           CLOSE OUT-REPORT-FILE

           EXIT.
