           02 OUTPUT-LINE-COUNT PIC 99999 VALUE 0.
           02 OUTPUT-TEXT PIC X(120) OCCURS 95000 TIMES.
           02 OUTPUT-LINE-MAX-COUNT PIC 99999 VALUE 95000.
           