       02 SANCTIONS OCCURS 225 TIMES.
           COPY "SanctionRecord.cpy".
       02 SANCTIONS-COUNT PIC 999 VALUE 0.
       02 SANCTIONS-MAX-COUNT PIC 999 VALUE 225.