           03 SANCTION-ID           PIC X(5).
           03 SANCTION-NAME         PIC X(20).
           03 SANCTION-ALIAS-1      PIC X(20).
           03 SANCTION-ALIAS-2      PIC X(20).
           03 SANCTION-ALIAS-3      PIC X(20).
           03 SANCTION-ALIAS-4      PIC X(20).
           03 SANCTION-ALIAS-5      PIC X(20).
           03 SANCTION-BIRTHDATE    PIC X(10).
           03 SANCTION-COUNTRY      PIC X(2).
           