       02 REFERENCE-ID PIC X(10) VALUE SPACES.
       02 FIRST-NAME PIC X(20) VALUE SPACES.
       02 LAST-NAME PIC X(20) VALUE SPACES.
       02 FULLNAME PIC X(40) VALUE SPACES.
       02 CLEANED-FULLNAME PIC X(40) VALUE SPACES.
       02 BANK-INFO.
       03 ACCOUNT-NUMBER PIC X(20) VALUE SPACES.
       03 CURRENCY-CODE PIC X(3) VALUE SPACES.
       03 BALANCE PIC 9(7)V99 VALUE ZEROES.
       03 BALANCE-DISPLAY PIC Z(6)9.99 VALUE ZEROES.