       03 STREET-NAME PIC X(40) VALUE SPACES.
       03 HOUSE-NUMBER PIC X(5) VALUE SPACES.
       03 FLOOR PIC X(5) VALUE SPACES.
       03 SIDE PIC X(5) VALUE SPACES.
       03 CITY PIC X(50) VALUE SPACES.
       03 ZIPCODE PIC X(10) VALUE SPACES.
       03 COUNTRYCODE PIC X(3) VALUE SPACES.