       02 FIRST-NAME PIC X(20).
       02 LAST-NAME PIC X(20).
       
       COPY "BankInfo.cpy".

       COPY "AddressInfo.cpy".    

       02 CONTACT-INFO.
       03 PHONE-NUMBER PIC X(15).
       03 EMAIL PIC X(80).
