           COPY "Identification.cpy".
           03 BANK-NAME PIC X(30).       
           03 BANK-ADDRESS PIC X(50).       
           03 TELEFON PIC X(15).
           03 EMAIL PIC X(31).
