       IDENTIFICATION DIVISION.
       PROGRAM-ID. INPUTLOADER.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-TRANSACTIONS-FILE
               ASSIGN TO "Transactions.txt"
               ORGANIZATION IS LINE SEQUENTIAL.

           SELECT IN-BANKS-FILE
               ASSIGN TO "Banks.txt"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD IN-BANKS-FILE.
       01 IN-BANK-RECORD.
           COPY "BankRecord.cpy".

       FD IN-TRANSACTIONS-FILE.
       01 IN-TRANSACTION-RECORD.
           COPY "TransactionRecord.cpy".

       WORKING-STORAGE SECTION.
       01 END-OF-FILE PIC X VALUE "N".
       01 LINE-INDEX PIC 9999 VALUE 1.

       LINKAGE SECTION.
       01 LINK-BANKS-WRAPPER.
           02 BANKS OCCURS 40 TIMES.
               COPY "BankRecord.cpy".
           02 BANKS-MAX-COUNT PIC 99.
           02 BANKS-COUNT PIC 99.

       01 LINK-TRANSACTIONS-WRAPPER.
           02 TRANSACTIONS OCCURS 600 TIMES.
               COPY "Transaction.cpy".      
           02 TRANSACTIONS-MAX-COUNT PIC 999.
           02 TRANSACTIONS-COUNT PIC 999.

       PROCEDURE DIVISION USING
           LINK-BANKS-WRAPPER
           LINK-TRANSACTIONS-WRAPPER.

           PERFORM LOAD-BANKS-DATA-TO-ARRAY
           PERFORM RESET-LOOP-VARIABLES
           PERFORM LOAD-TRANSACTIONS-DATA-TO-ARRAY

           GOBACK.

       LOAD-TRANSACTIONS-DATA-TO-ARRAY.
           DISPLAY "START LOAD-TRANSACTIONS, LINE-INDEX = " LINE-INDEX
           OPEN INPUT IN-TRANSACTIONS-FILE
           PERFORM UNTIL END-OF-FILE = "Y"
               READ IN-TRANSACTIONS-FILE INTO IN-TRANSACTION-RECORD
               AT END
                   DISPLAY "Found End of Transactions "
                   "Information file on line: " LINE-INDEX
                   MOVE "Y" TO END-OF-FILE
               NOT AT END
                   IF TRANSACTIONS-COUNT >= TRANSACTIONS-MAX-COUNT
                       DISPLAY "ERROR: LOAD-TRANSACTIONS-DATA-TO-ARRAY "
                       "attempted to write outside TRANSACTIONS array."
                       DISPLAY "File line: " LINE-INDEX
                       DISPLAY "TRANSACTIONS-MAX-COUNT: "
                           TRANSACTIONS-MAX-COUNT
                       MOVE "Y" TO END-OF-FILE
                       EXIT PARAGRAPH
                   END-IF
                   PERFORM MOVE-TRANSACTION-RECORD-TO-ARRAY
                   DISPLAY "Not At End Index: " LINE-INDEX
                   ADD 1 TO LINE-INDEX
                   ADD 1 TO TRANSACTIONS-COUNT
               END-READ
           END-PERFORM
           DISPLAY "END LOAD-TRANSACTIONS, LINE-INDEX = " LINE-INDEX
           CLOSE IN-TRANSACTIONS-FILE
           EXIT.

       MOVE-TRANSACTION-RECORD-TO-ARRAY.
           MOVE CPR OF IN-TRANSACTION-RECORD
               TO CPR OF TRANSACTIONS(LINE-INDEX)

           MOVE CUSTOMER-NAME OF IN-TRANSACTION-RECORD
               TO CUSTOMER-NAME OF TRANSACTIONS(LINE-INDEX)

           MOVE CUSTOMER-ADDRESS OF IN-TRANSACTION-RECORD
               TO CUSTOMER-ADDRESS OF TRANSACTIONS(LINE-INDEX)

           MOVE BIRTHDAY OF IN-TRANSACTION-RECORD
               TO BIRTHDAY OF TRANSACTIONS(LINE-INDEX)

           MOVE ACCOUNT-IDENTIFICATION OF IN-TRANSACTION-RECORD
               TO ACCOUNT-IDENTIFICATION OF TRANSACTIONS(LINE-INDEX)

           MOVE REGISTRATION-NUMBER OF IN-TRANSACTION-RECORD
               TO REGISTRATION-NUMBER OF TRANSACTIONS(LINE-INDEX)

           MOVE RAW-AMOUNT OF IN-TRANSACTION-RECORD
               TO RAW-AMOUNT OF TRANSACTIONS(LINE-INDEX)

           MOVE CURRENCY-CODE OF IN-TRANSACTION-RECORD
               TO CURRENCY-CODE OF TRANSACTIONS(LINE-INDEX)

           MOVE TRANSACTION-TYPE OF IN-TRANSACTION-RECORD
               TO TRANSACTION-TYPE OF TRANSACTIONS(LINE-INDEX)

           MOVE TRANSACTION-SHOP OF IN-TRANSACTION-RECORD
               TO TRANSACTION-SHOP OF TRANSACTIONS(LINE-INDEX)

           MOVE TIME-OF-TRANSACTION OF IN-TRANSACTION-RECORD
               TO TIME-OF-TRANSACTION OF TRANSACTIONS(LINE-INDEX)

           PERFORM COMPUTE-AMOUNT
           EXIT.

       COMPUTE-AMOUNT.
           COMPUTE AMOUNT OF TRANSACTIONS(LINE-INDEX) =
               FUNCTION NUMVAL(RAW-AMOUNT OF IN-TRANSACTION-RECORD)

           IF TRANSACTION-TYPE OF IN-TRANSACTION-RECORD = "Indbetaling"
              OR TRANSACTION-TYPE
               OF IN-TRANSACTION-RECORD = "Udbetaling"

               COMPUTE AMOUNT OF TRANSACTIONS(LINE-INDEX) =
                   FUNCTION ABS(AMOUNT OF TRANSACTIONS(LINE-INDEX))
           END-IF

           MOVE AMOUNT OF TRANSACTIONS(LINE-INDEX)
               TO AMOUNT-DISPLAY OF TRANSACTIONS(LINE-INDEX)

           IF CURRENCY-CODE OF IN-TRANSACTION-RECORD = "USD"
               COMPUTE DKK-AMOUNT OF TRANSACTIONS(LINE-INDEX) =
                   AMOUNT OF TRANSACTIONS(LINE-INDEX) * 6.8
               MOVE DKK-AMOUNT OF TRANSACTIONS(LINE-INDEX)
                   TO DKK-AMOUNT-DISPLAY OF TRANSACTIONS(LINE-INDEX)
           ELSE IF CURRENCY-CODE OF IN-TRANSACTION-RECORD = "EUR"
               COMPUTE DKK-AMOUNT OF TRANSACTIONS(LINE-INDEX) =
                   AMOUNT OF TRANSACTIONS(LINE-INDEX) * 7.5
               MOVE DKK-AMOUNT OF TRANSACTIONS(LINE-INDEX)
                   TO DKK-AMOUNT-DISPLAY OF TRANSACTIONS(LINE-INDEX)
           ELSE IF CURRENCY-CODE OF IN-TRANSACTION-RECORD = "DKK"
               MOVE AMOUNT OF TRANSACTIONS(LINE-INDEX)
                   TO DKK-AMOUNT OF TRANSACTIONS(LINE-INDEX)
               MOVE DKK-AMOUNT OF TRANSACTIONS(LINE-INDEX)
                   TO DKK-AMOUNT-DISPLAY OF TRANSACTIONS(LINE-INDEX)
           END-IF

           EXIT.

       LOAD-BANKS-DATA-TO-ARRAY.
           DISPLAY "START LOAD-BANKS, LINE-INDEX = " LINE-INDEX
           OPEN INPUT IN-BANKS-FILE
           PERFORM UNTIL END-OF-FILE = "Y"
               READ IN-BANKS-FILE INTO IN-BANK-RECORD
               AT END
                   DISPLAY "Found End of Banks "
                   "Information file on line: " LINE-INDEX
                   MOVE "Y" TO END-OF-FILE
               NOT AT END
                   IF BANKS-COUNT >= BANKS-MAX-COUNT
                       DISPLAY "ERROR: LOAD-BANKS-DATA-TO-ARRAY "
                       "attempted to write outside BANKS array."
                       DISPLAY "File line: " LINE-INDEX
                       DISPLAY "BANKS-MAX-COUNT: " BANKS-MAX-COUNT
                       MOVE "Y" TO END-OF-FILE
                       EXIT PARAGRAPH
                   END-IF
                   PERFORM MOVE-BANK-RECORD-TO-ARRAY
                   DISPLAY "Not At End Index: " LINE-INDEX
                   ADD 1 TO LINE-INDEX
                   ADD 1 TO BANKS-COUNT
               END-READ
           END-PERFORM
           DISPLAY "END LOAD-BANKS, LINE-INDEX = " LINE-INDEX
           CLOSE IN-BANKS-FILE
           EXIT.

       MOVE-BANK-RECORD-TO-ARRAY.
           MOVE REGISTRATION-NUMBER OF IN-BANK-RECORD
               TO REGISTRATION-NUMBER OF BANKS(LINE-INDEX)

           MOVE BANK-NAME OF IN-BANK-RECORD
               TO BANK-NAME OF BANKS(LINE-INDEX)

           MOVE BANK-ADDRESS OF IN-BANK-RECORD
               TO BANK-ADDRESS OF BANKS(LINE-INDEX)

           MOVE TELEFON OF IN-BANK-RECORD
               TO TELEFON OF BANKS(LINE-INDEX)

           MOVE EMAIL OF IN-BANK-RECORD
               TO EMAIL OF BANKS(LINE-INDEX)

           EXIT.

       RESET-LOOP-VARIABLES.
           DISPLAY "RESETTING LOOP VARIABLES. LINE-INDEX BEFORE = "
               LINE-INDEX
           MOVE 1 TO LINE-INDEX
           MOVE "N" TO END-OF-FILE
           DISPLAY "RESET DONE. LINE-INDEX AFTER = " LINE-INDEX
           EXIT.
