           COPY "TransactionRecord.cpy".
           03 AMOUNT PIC S9(11)V99.
           03 AMOUNT-DISPLAY PIC -Z,ZZZ,ZZZ,ZZZ,ZZ9.99.
           03 DKK-AMOUNT PIC S9(11)V99.
           03 DKK-AMOUNT-DISPLAY PIC -Z,ZZZ,ZZZ,ZZZ,ZZ9.99.
