           COPY "CustomerInfo.cpy".   
           02 BIRTHDAY PIC X(11).
           02 ACCOUNT-IDENTIFICATION PIC X(14).           
           COPY "Identification.cpy".
           02 RAW-AMOUNT PIC X(17).
           02 CURRENCY-CODE PIC X(4).
           02 TRANSACTION-TYPE PIC X(20).
           02 SHOP PIC X(20).
           02 TIME-OF-TRANSACTION PIC X(26).
