           COPY "CustomerInfo.cpy".   
           03 BIRTHDAY PIC X(11).
           03 ACCOUNT-IDENTIFICATION PIC X(14).           
           COPY "Identification.cpy".
           03 RAW-AMOUNT PIC X(17).
           03 CURRENCY-CODE PIC X(4).
           03 TRANSACTION-TYPE PIC X(20).
           03 TRANSACTION-SHOP PIC X(20).
           03 TIME-OF-TRANSACTION PIC X(26).
