       IDENTIFICATION DIVISION. 
       PROGRAM-ID. Bank.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION. 
       01 USER-ID PIC A(10) VALUE SPACES.
       01 FIRST-NAME PIC A(20) VALUE SPACES.
       01 LAST-NAME PIC A(20) VALUE SPACES.
       01 ACCOUNT-NUMBER PIC A(20) VALUE SPACES.
       01 CURRENCY-CODE PIC A(3) VALUE SPACES.
       01 BALANCE PIC 9(7)V99 VALUE ZEROES.

       PROCEDURE DIVISION. 

       STOP RUN.
