       IDENTIFICATION DIVISION. 
       PROGRAM-ID. Bank.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION. 
       01 USER-ID PIC A(10) VALUE SPACES.
       01 FIRST-NAME PIC A(20) VALUE SPACES.
       01 LAST-NAME PIC A(20) VALUE SPACES.
       01 ACCOUNT-NUMBER PIC A(20) VALUE SPACES.
       01 CURRENCY-CODE PIC A(3) VALUE SPACES.
       01 BALANCE PIC 9(7)V99 VALUE ZEROES.

       PROCEDURE DIVISION.
       MOVE "9876543210" TO USER-ID
       MOVE "Hans" TO FIRST-NAME
       MOVE "Hansen" TO LAST-NAME
       MOVE "DK98765432112345" TO ACCOUNT-NUMBER
       MOVE "DKK" TO CURRENCY-CODE
       MOVE 420.69 TO BALANCE

       DISPLAY USER-ID
       DISPLAY FIRST-NAME " " LAST-NAME
       DISPLAY ACCOUNT-NUMBER
       DISPLAY BALANCE " " CURRENCY-CODE

       STOP RUN.
