       IDENTIFICATION DIVISION. 
       PROGRAM-ID. HELLO. 
       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       PROCEDURE DIVISION. 
      *Nedenfor kommer en display - Cobols måde at skrive i konsollen 
       DISPLAY "HELLO, WORLD!"
       STOP RUN.
