       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUT-CUSTOMER-FILE
               ASSIGN TO "CustomerinformationOut.txt"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT IN-CUSTOMER-FILE
               ASSIGN TO "CustomerinformationIn.txt"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD IN-CUSTOMER-FILE.
       01 IN-CUSTOMER-RECORD.
           COPY "Customer.cpy".

       FD OUT-CUSTOMER-FILE.
       01 OUT-CUSTOMER-RECORD.
           COPY "Customer.cpy".

       WORKING-STORAGE SECTION.
       01 END-OF-FILE PIC X VALUE "N".
       01 BALANCE-DISPLAY PIC Z(6)9.99 VALUE ZEROES.
       01 FULLNAME PIC X(41) VALUE SPACES.


       PROCEDURE DIVISION.
           OPEN INPUT IN-CUSTOMER-FILE
           OPEN OUTPUT OUT-CUSTOMER-FILE

           PERFORM UNTIL END-OF-FILE = "Y"
               READ IN-CUSTOMER-FILE INTO IN-CUSTOMER-RECORD
                   AT END
                       MOVE "Y" TO END-OF-FILE
                   NOT AT END
                       PERFORM BUILD-DERIVED-FIELDS
                       PERFORM DISPLAY-CUSTOMER
                       MOVE IN-CUSTOMER-RECORD TO OUT-CUSTOMER-RECORD
                       WRITE OUT-CUSTOMER-RECORD
               END-READ
           END-PERFORM

           CLOSE IN-CUSTOMER-FILE
           CLOSE OUT-CUSTOMER-FILE

           STOP RUN.

       DISPLAY-CUSTOMER.
           DISPLAY "------------------------------"
           DISPLAY "REFERENCE-ID   :" REFERENCE-ID OF IN-CUSTOMER-RECORD
           DISPLAY "FULLNAME       :" FULLNAME
           DISPLAY "ACCOUNT-NUMBER :" ACCOUNT-NUMBER 
               OF IN-CUSTOMER-RECORD
           DISPLAY "CURRENCY-CODE  :" CURRENCY-CODE 
               OF IN-CUSTOMER-RECORD
           DISPLAY "BALANCE        :" FUNCTION
               TRIM(BALANCE-DISPLAY LEADING)
           DISPLAY "STREET-NAME    :" STREET-NAME OF IN-CUSTOMER-RECORD
           DISPLAY "HOUSE-NUMBER   :" HOUSE-NUMBER OF IN-CUSTOMER-RECORD
           DISPLAY "FLOOR          :" FLOOR OF IN-CUSTOMER-RECORD
           DISPLAY "SIDE           :" SIDE OF IN-CUSTOMER-RECORD
           DISPLAY "CITY           :" CITY OF IN-CUSTOMER-RECORD
           DISPLAY "ZIPCODE        :" ZIPCODE OF IN-CUSTOMER-RECORD
           DISPLAY "COUNTRYCODE    :" COUNTRYCODE OF IN-CUSTOMER-RECORD
           DISPLAY "PHONE-NUMBER   :" PHONE-NUMBER OF IN-CUSTOMER-RECORD
           DISPLAY "EMAIL          :" EMAIL OF IN-CUSTOMER-RECORD.

       BUILD-DERIVED-FIELDS.
           STRING
               FIRST-NAME OF IN-CUSTOMER-RECORD DELIMITED BY SPACE
               " " DELIMITED BY SIZE
               LAST-NAME OF IN-CUSTOMER-RECORD DELIMITED BY SPACE
               INTO FULLNAME
           END-STRING

           MOVE BALANCE OF IN-CUSTOMER-RECORD TO BALANCE-DISPLAY.
