       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUT-CUSTOMER-FILE
               ASSIGN TO "CustomerinformationOut.txt"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUT-NEW-CUSTOMER-FILE
               ASSIGN TO "CustomerinformationOutNew.txt"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT IN-CUSTOMER-FILE
               ASSIGN TO "CustomerinformationIn.txt"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD IN-CUSTOMER-FILE.
       01 IN-CUSTOMER-RECORD.
           COPY "Customer.cpy".

       FD OUT-CUSTOMER-FILE.
       01 OUT-CUSTOMER-RECORD.
           COPY "Customer.cpy".
       
       FD OUT-NEW-CUSTOMER-FILE.
       01 OUT-NEW-CUSTOMER-RECORD.
           COPY "Customer.cpy".
           02 OUT-BALANCE-DISPLAY PIC Z(6)9.99 VALUE ZEROES.
           02 OUT-FULLNAME PIC X(41) VALUE SPACES.

       WORKING-STORAGE SECTION.
       01 END-OF-FILE PIC X VALUE "N".
       01 BALANCE-DISPLAY PIC Z(6)9.99 VALUE ZEROES.
       01 FULLNAME PIC X(41) VALUE SPACES.


       PROCEDURE DIVISION.
           OPEN INPUT IN-CUSTOMER-FILE
           OPEN OUTPUT OUT-CUSTOMER-FILE
           OPEN OUTPUT OUT-NEW-CUSTOMER-FILE

           PERFORM UNTIL END-OF-FILE = "Y"
               READ IN-CUSTOMER-FILE INTO IN-CUSTOMER-RECORD
                   AT END
                       MOVE "Y" TO END-OF-FILE
                   NOT AT END
                       PERFORM BUILD-DERIVED-FIELDS
                       PERFORM DISPLAY-CUSTOMER
                       PERFORM MOVE-INPUT-TO-NEW-OUTPUT
                       MOVE IN-CUSTOMER-RECORD TO OUT-CUSTOMER-RECORD
                       WRITE OUT-CUSTOMER-RECORD
                       WRITE OUT-NEW-CUSTOMER-RECORD
               END-READ
           END-PERFORM

           CLOSE IN-CUSTOMER-FILE
           CLOSE OUT-CUSTOMER-FILE
           CLOSE OUT-NEW-CUSTOMER-FILE

           STOP RUN.

       DISPLAY-CUSTOMER.
           DISPLAY "------------------------------"
           DISPLAY "REFERENCE-ID   :" REFERENCE-ID OF IN-CUSTOMER-RECORD
           DISPLAY "FULLNAME       :" FULLNAME
           DISPLAY "ACCOUNT-NUMBER :" ACCOUNT-NUMBER 
               OF IN-CUSTOMER-RECORD
           DISPLAY "CURRENCY-CODE  :" CURRENCY-CODE 
               OF IN-CUSTOMER-RECORD
           DISPLAY "BALANCE        :" FUNCTION
               TRIM(BALANCE-DISPLAY LEADING)
           DISPLAY "STREET-NAME    :" STREET-NAME OF IN-CUSTOMER-RECORD
           DISPLAY "HOUSE-NUMBER   :" HOUSE-NUMBER OF IN-CUSTOMER-RECORD
           DISPLAY "FLOOR          :" FLOOR OF IN-CUSTOMER-RECORD
           DISPLAY "SIDE           :" SIDE OF IN-CUSTOMER-RECORD
           DISPLAY "CITY           :" CITY OF IN-CUSTOMER-RECORD
           DISPLAY "ZIPCODE        :" ZIPCODE OF IN-CUSTOMER-RECORD
           DISPLAY "COUNTRYCODE    :" COUNTRYCODE OF IN-CUSTOMER-RECORD
           DISPLAY "PHONE-NUMBER   :" PHONE-NUMBER OF IN-CUSTOMER-RECORD
           DISPLAY "EMAIL          :" EMAIL OF IN-CUSTOMER-RECORD

           EXIT.

       BUILD-DERIVED-FIELDS.
           STRING
               FIRST-NAME OF IN-CUSTOMER-RECORD DELIMITED BY SPACE
               " " DELIMITED BY SIZE
               LAST-NAME OF IN-CUSTOMER-RECORD DELIMITED BY SPACE
               INTO FULLNAME
           END-STRING

           MOVE BALANCE OF IN-CUSTOMER-RECORD TO BALANCE-DISPLAY

           EXIT.

       MOVE-INPUT-TO-NEW-OUTPUT.
           MOVE REFERENCE-ID   OF IN-CUSTOMER-RECORD
             TO REFERENCE-ID   OF OUT-NEW-CUSTOMER-RECORD

           MOVE FIRST-NAME     OF IN-CUSTOMER-RECORD
             TO FIRST-NAME     OF OUT-NEW-CUSTOMER-RECORD

           MOVE LAST-NAME      OF IN-CUSTOMER-RECORD
             TO LAST-NAME      OF OUT-NEW-CUSTOMER-RECORD

           MOVE FULLNAME TO OUT-FULLNAME

           MOVE ACCOUNT-NUMBER OF IN-CUSTOMER-RECORD
             TO ACCOUNT-NUMBER OF OUT-NEW-CUSTOMER-RECORD

           MOVE CURRENCY-CODE  OF IN-CUSTOMER-RECORD
             TO CURRENCY-CODE  OF OUT-NEW-CUSTOMER-RECORD

           MOVE BALANCE        OF IN-CUSTOMER-RECORD
             TO BALANCE        OF OUT-NEW-CUSTOMER-RECORD

           MOVE BALANCE-DISPLAY TO OUT-BALANCE-DISPLAY

           MOVE STREET-NAME    OF IN-CUSTOMER-RECORD
             TO STREET-NAME    OF OUT-NEW-CUSTOMER-RECORD

           MOVE HOUSE-NUMBER   OF IN-CUSTOMER-RECORD
             TO HOUSE-NUMBER   OF OUT-NEW-CUSTOMER-RECORD

           MOVE FLOOR          OF IN-CUSTOMER-RECORD
             TO FLOOR          OF OUT-NEW-CUSTOMER-RECORD

           MOVE SIDE           OF IN-CUSTOMER-RECORD
             TO SIDE           OF OUT-NEW-CUSTOMER-RECORD

           MOVE CITY           OF IN-CUSTOMER-RECORD
             TO CITY           OF OUT-NEW-CUSTOMER-RECORD

           MOVE ZIPCODE        OF IN-CUSTOMER-RECORD
             TO ZIPCODE        OF OUT-NEW-CUSTOMER-RECORD

           MOVE COUNTRYCODE    OF IN-CUSTOMER-RECORD
             TO COUNTRYCODE    OF OUT-NEW-CUSTOMER-RECORD

           MOVE PHONE-NUMBER   OF IN-CUSTOMER-RECORD
             TO PHONE-NUMBER   OF OUT-NEW-CUSTOMER-RECORD

           MOVE EMAIL          OF IN-CUSTOMER-RECORD
             TO EMAIL          OF OUT-NEW-CUSTOMER-RECORD

           EXIT.
