       IDENTIFICATION DIVISION. 
       PROGRAM-ID. Bank.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION. 
       01 CUSTOMER-ID PIC X(10) VALUE SPACES.
       01 FIRST-NAME PIC X(20) VALUE SPACES.
       01 LAST-NAME PIC X(20) VALUE SPACES.
       01 FULLNAME PIC X(40) VALUE SPACES.
       01 ACCOUNT-NUMBER PIC X(20) VALUE SPACES.
       01 CURRENCY-CODE PIC X(3) VALUE SPACES.
       01 BALANCE PIC 9(7)V99 VALUE ZEROES.

       01 INDEX-ONE PIC 9(2) VALUE ZEROES.
       01 INDEX-TWO PIC 9(2) VALUE ZEROES.
       01 CURRENT-CHAR PIC X VALUE SPACES.
       01 PREVIOUS-CHAR PIC X VALUE SPACES.
       01 CLEANED-FULLNAME PIC X(40) VALUE SPACES.


       PROCEDURE DIVISION.
       MOVE "9876543210" TO CUSTOMER-ID.
       MOVE "Hans" TO FIRST-NAME.
       MOVE "Hansen" TO LAST-NAME.
       MOVE "DK98765432112345" TO ACCOUNT-NUMBER.
       MOVE "DKK" TO CURRENCY-CODE.
       MOVE 420.69 TO BALANCE.

       STRING FIRST-NAME DELIMITED BY SIZE " " 
           DELIMITED BY SIZE LAST-NAME 
           DELIMITED BY SIZE 
           INTO FULLNAME.

       PERFORM VARYING INDEX-ONE FROM 1 BY 1 
           UNTIL INDEX-ONE > LENGTH OF FULLNAME
       
       MOVE CURRENT-CHAR TO PREVIOUS-CHAR
       MOVE FULLNAME(INDEX-ONE:1) TO CURRENT-CHAR
       
       IF CURRENT-CHAR NOT = SPACE OR PREVIOUS-CHAR NOT = SPACE

           ADD 1 TO INDEX-TWO
           MOVE CURRENT-CHAR TO CLEANED-FULLNAME(INDEX-TWO:1)

       END-IF
       END-PERFORM

       DISPLAY "--------------------------------------".
       DISPLAY "Customer ID    : " CUSTOMER-ID.
       DISPLAY "Full Name      : " CLEANED-FULLNAME.
       DISPLAY "Account Number : " ACCOUNT-NUMBER.
       DISPLAY "Balance        : " BALANCE " " CURRENCY-CODE.
       DISPLAY "--------------------------------------".

       STOP RUN.
