       02 ADDRESS-INFO.       
       03 STREET-NAME PIC X(40).
       03 HOUSE-NUMBER PIC X(5).
       03 FLOOR PIC X(5).
       03 SIDE PIC X(5).
       03 CITY PIC X(50).
       03 ZIPCODE PIC X(10).
       03 COUNTRYCODE PIC X(3).
